VPro/src/Reports/ServiceContractsExecution/ServiceContractsExecution.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ServiceContractsExecution</name>
  <attributes>
    <name>IsCMReport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

VPro/src/Catalogs/Counterparties/Counterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Counterparties</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccountByDefault</name>
    <comment>Bank account by default</comment>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByContracts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackPaymentsByBills</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.CounterpartiesAccessGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractByDefault</name>
    <comment>Default counterparty contract</comment>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>BasicInformation</name>
    <comment>It used to search in the list</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCustomerSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountVendorSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAcquisitionChannel</name>
    <type>
      <types>CatalogRef.CustomerAcquisitionChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OtherRelationship</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.IndividualGender</types>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Reports/ServiceContractsExecution/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

Procedure OnDefineReportSettings(ReportSettings, VariantsSettings) Export
	
	ReportSettings.ShowChartSettingsOnReportForm = False;
	ReportSettings.UseComparison = True;
	ReportSettings.UsePeriodicity = True;
	ReportSettings.Insert("PeriodMode", "ForPeriod");
	
	VariantsSettings["Main"].Tags = NStr("en='Sales,Billings,Regular services';ru='Продажи,Биллинг,Регулярные услуги';vi='Bán hàng, Tự động lập yêu cầu thanh toán, Dịch vụ thông thường'");
	VariantsSettings["Main"].Recommended = True;
	VariantsSettings["Main"].FunctionalOption = "UseBilling";
	
	AddRelatedFieldsDescriptions(VariantsSettings);
	
	If Constants.BillingKeepExpensesAccountingByServiceContracts.Get() Then
		SelectedFieldKD = SettingsComposer.Settings.Selection.Items.Insert(0, Type("DataCompositionSelectedField"));
		SelectedFieldKD.Field = New DataCompositionField("AmountExpenses");
		SelectedFieldKD.Use = True;
	EndIf;
	
EndProcedure

#EndRegion

#Region EventsHandlers

Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing) Export
	
	ServiceContracts = New ValueList;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	CounterpartyContracts.Ref AS Ref
	|FROM
	|	Catalog.CounterpartyContracts AS CounterpartyContracts
	|WHERE
	|	CounterpartyContracts.IsServiceContract
	|	AND NOT CounterpartyContracts.DeletionMark";
	SELECTION = Query.Execute().Select();
	While SELECTION.Next() Do
		ServiceContracts.Add(SELECTION.Ref);
	EndDo;
	
	SmallBusinessReports.SetReportParameterByDefault(SettingsComposer.Settings, "AccountingCurrency", SmallBusinessReUse.GetAccountCurrency());
	SmallBusinessReports.SetReportParameterByDefault(SettingsComposer.Settings, "ServiceContracts", ServiceContracts);
	SmallBusinessReports.AddCurrencyCharToFieldsHeaders(DataCompositionSchema, "AmountExpenses,AmountInvoiced,InCounterpartyDebtCur,DeCounterpartyDebtCur");
	SmallBusinessReports.OnResultComposition(SettingsComposer, DataCompositionSchema, ResultDocument, DetailsData, StandardProcessing);
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

Procedure AddRelatedFieldsDescriptions(VariantsSettings)
	
	VariantStructure = VariantsSettings["Main"];
	SmallBusinessReports.AddBindingDetails(VariantStructure.LinkedFields, "ServiceContract", "Catalog.CounterpartyContracts",,, True);
	SmallBusinessReports.AddBindingDetails(VariantStructure.LinkedFields, "Counterparty", "Catalog.Counterparties",,, True);
	
EndProcedure

Function FindGroupingByDataCompositionFieldRecursively(DCSettingsStructureItemsCollection, DCField)
	
	For Each DCGroup In DCSettingsStructureItemsCollection Do
		For Each DCGroupingField In DCGroup.GroupFields.Items Do
			If DCGroupingField.Field = DCField Then
				Return DCGroup;
			EndIf;
		EndDo;
		FoundDCGroup = FindGroupingByDataCompositionFieldRecursively(DCGroup.Structure, DCField);
		If FoundDCGroup <> Undefined Then
			Return FoundDCGroup;
		EndIf;
	EndDo;
	
	Return Undefined;
	
EndFunction

#EndRegion

IsCMReport = True;

#EndIf
